server/app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "first article"], ["description", "description for first article"], ["created_at", "2023-08-04 05:46:40.238562"], ["updated_at", "2023-08-04 05:46:40.238562"]]
---
  def index
    @articles = Article.all
    article = []
    @articles.each do |obj|
    article << {"article": obj, "likes": obj.likes, "comments": obj.comments}

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "this is updated assignment"], ["description", "this is updated description of the assignment"], ["updated_at", "2023-08-06 14:08:05.596902"], ["id", 23]]
---
  def update
    @article = Article.find(params[:id])
    if @article.user != @current_user
      return render json: {msg: "you are not author of article"}
    end
    if @article.update(params.require(:article).permit(:title, :description))

INSERT INTO "articles" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)
---
  def create
    @article = Article.new(article_params)
    @article.user = @current_user
    if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 23]]
---
  def destroy
    @article = Article.find(params[:id])
    if @article.user != @current_user
      return render json: {msg: "you are not author of article"}
    end
    if @article.destroy

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def require_authentication
    header = request.headers['Authorization']
    token = header.split(' ').last if header

    begin
      decoded_token = JWT.decode(token, 'your_secret_key', true, algorithm: 'HS256')
      render json: {error: "invalid token"} if !decoded_token[0]['user_id']
      @current_user = User.find(decoded_token[0]['user_id'])