server/app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    @comment.user_id = @current_user.id
    if @comment.save
---
INSERT INTO "comments" ("text", "article_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["text", "this is a random comment again"], ["article_id", 2], ["user_id", 1], ["created_at", "2023-08-05 20:23:54.526683"], ["updated_at", "2023-08-05 20:23:54.526683"]]

  def update
    @comment = Comment.find(params[:id])
    if @comment.user_id != @current_user.id
      return render json: {msg: "you are not the author"}
    end
    if @comment.update(comment_params)
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "comments" SET "text" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["text", "changed the comment"], ["updated_at", "2023-08-06 14:23:16.630238"], ["id", 15]]

    def require_authentication
      header = request.headers['Authorization']
      token = header.split(' ').last if header

      begin
        decoded_token = JWT.decode(token, 'your_secret_key', true, algorithm: 'HS256')
        render json: {error: "invalid token"} if !decoded_token[0]['user_id']
        @current_user = User.find(decoded_token[0]['user_id'])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    @comment = Comment.find(params[:id])
    if @comment.user_id != @current_user.id
      return render json: {msg: "you are not the author"}
    end
    if @comment.destroy
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 4]]

  def require_authentication
    header = request.headers['Authorization']
    token = header.split(' ').last if header

    begin
      decoded_token = JWT.decode(token, 'your_secret_key', true, algorithm: 'HS256')
      render json: {error: "invalid token"} if !decoded_token[0]['user_id']
      @current_user = User.find(decoded_token[0]['user_id'])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]