server/app/controllers/comments_controller.rb

  def destroy
    @comment = Comment.find(params[:id])
    if @comment.destroy
---
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 2]]