server/app/controllers/followers_controller.rb

  def destroy
    @follower = Follower.find_by(user_id: @current_user.id, follower_id: followers_params["follower_id"])
    if !@follower
      return render json: {msg: "no follower exists"}
    end
    if @follower.destroy
---
SELECT "followers".* FROM "followers" WHERE "followers"."user_id" = ? AND "followers"."follower_id" = ? LIMIT ?  [["user_id", 2], ["follower_id", 3], ["LIMIT", 1]]
DELETE FROM "followers" WHERE "followers"."id" = ?  [["id", 3]]

  def require_authentication
    header = request.headers['Authorization']
    token = header.split(' ').last if header

    begin
      decoded_token = JWT.decode(token, 'your_secret_key', true, algorithm: 'HS256')
      render json: {error: "invalid token"} if !decoded_token[0]['user_id']
      @current_user = User.find(decoded_token[0]['user_id'])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]