server/app/controllers/followers_controller.rb

  def create
    @follower = Follower.new(followers_params)
    if @follower.save
---
INSERT INTO "followers" ("user_id", "follower_id") VALUES (?, ?)  [["user_id", 1], ["follower_id", 2]]

  def destroy
    @follower = Follower.find(params[:id])
---
SELECT "followers".* FROM "followers" WHERE "followers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]