server/app/controllers/followings_controller.rb

  def destroy
    @following = Following.find(params[:id])
    if @following.destroy
---
SELECT "followings".* FROM "followings" WHERE "followings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "followings" WHERE "followings"."id" = ?  [["id", 1]]