server/app/controllers/followings_controller.rb

SELECT "followings".* FROM "followings" WHERE "followings"."user_id" = ? AND "followings"."following_id" = ? LIMIT ?  [["user_id", 2], ["following_id", 3], ["LIMIT", 1]]
DELETE FROM "followings" WHERE "followings"."id" = ?  [["id", 4]]
INSERT INTO "followings" ("user_id", "following_id") VALUES (?, ?)  [["user_id", 1], ["following_id", 3]]
INSERT INTO "followers" ("user_id", "follower_id") VALUES (?, ?)  [["user_id", 3], ["follower_id", 1]]
---
  def create
    @existing_following = Following.find_by(user_id: @current_user.id, following_id: followings_params[:following_id])

    if @existing_following
      @existing_following.destroy
      return render json: {msg: "unfollowed"}
    end
    @following = Following.new(followings_params)
    @following.user_id = @current_user.id
    if @following.save
      @x = Follower.create(user_id: followings_params[:following_id], follower_id: @current_user.id)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def require_authentication
    header = request.headers['Authorization']
    token = header.split(' ').last if header

    begin
      decoded_token = JWT.decode(token, 'your_secret_key', true, algorithm: 'HS256')
      render json: {error: "invalid token"} if !decoded_token[0]['user_id']
      @current_user = User.find(decoded_token[0]['user_id'])