server/app/controllers/likes_controller.rb

SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."article_id" = ? LIMIT ?  [["user_id", 2], ["article_id", nil], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 4]]
INSERT INTO "likes" ("user_id", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["article_id", 2], ["created_at", "2023-08-06 12:35:15.989227"], ["updated_at", "2023-08-06 12:35:15.989227"]]
---
  def create
    @existing_like = Like.find_by(user_id: @current_user.id, article_id: like_params[:article_id])
    if @existing_like
      @existing_like.destroy
      return  render json: {msg: "unliked"}
    end
    @like = Like.new(like_params)
    @like.user_id = @current_user.id
    if @like.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def require_authentication
    header = request.headers['Authorization']
    token = header.split(' ').last if header

    begin
      decoded_token = JWT.decode(token, 'your_secret_key', true, algorithm: 'HS256')
      render json: {error: "invalid token"} if !decoded_token[0]['user_id']
      @current_user = User.find(decoded_token[0]['user_id'])