server/app/controllers/likes_controller.rb

SELECT "likes".* FROM "likes" WHERE "likes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 1]]
---
  def destroy
    @like = Like.find(params[:id])
    if @like.destroy