server/app/controllers/recommendations_controller.rb

SELECT "articles".* FROM "articles"
SELECT "viewed_posts".* FROM "viewed_posts" WHERE "viewed_posts"."user_id" = ?  [["user_id", 1]]
---
  def recommend_articles()
    score_list = []
    all_articles = Article.all
    read_articles = @current_user.viewed_posts
    all_articles.each do |article|
      read_articles.each do |read_article|

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def require_authentication
    header = request.headers['Authorization']
    token = header.split(' ').last if header

    begin
      decoded_token = JWT.decode(token, 'your_secret_key', true, algorithm: 'HS256')
      render json: {error: "invalid token"} if !decoded_token[0]['user_id']
      @current_user = User.find(decoded_token[0]['user_id'])