server/app/controllers/subscriptions_controller.rb

INSERT INTO "subscriptions" ("user_id", "membership", "expiry", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["membership", 1], ["expiry", "2023-09-07"], ["created_at", "2023-08-07 12:40:23.924070"], ["updated_at", "2023-08-07 12:40:23.924070"]]
---
  def create
    @plans = ["no membership", "$3 membership", "$5 membership" , "$10 membership"]
    plan = membership_params
    subscription = Subscription.new(plan)
    subscription.expiry = Date.today + 1.month
    subscription.user = @current_user
    if subscription.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def require_authentication
    header = request.headers['Authorization']
    token = header.split(' ').last if header

    begin
      decoded_token = JWT.decode(token, 'your_secret_key', true, algorithm: 'HS256')
      render json: {error: "invalid token"} if !decoded_token[0]['user_id']
      @current_user = User.find(decoded_token[0]['user_id'])