server/app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    render json: {user: @user, articles: @user.articles, followers: @user.followers, following: @user.following, viewed_article: @user.viewed_posts, subscription: @user.subscriptions.last}
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."user_id" = ? ORDER BY "subscriptions"."id" DESC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]

  def update
    @user = User.find(@current_user.id)
    if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "users" SET "username" = ?, "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "cogoportNew"], ["email", "cogoport@cogoport.com"], ["password_digest", "updated_password"], ["updated_at", "2023-08-06 13:46:09.817740"], ["id", 7]]

  def index
    @users = User.all
    user_list = []
    @users.each do |user|
---
SELECT "users".* FROM "users"

  def require_authentication
    header = request.headers['Authorization']
    token = header.split(' ').last if header

    begin
      decoded_token = JWT.decode(token, 'your_secret_key', true, algorithm: 'HS256')
      render json: {error: "invalid token"} if !decoded_token[0]['user_id']
      @current_user = User.find(decoded_token[0]['user_id'])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]