server/app/controllers/viewedposts_controller.rb

  def create
    posts_viewed = (@current_user.viewed_posts)
    posts_viewed_today = posts_viewed.select{|obj| Date.parse(obj.created_at.to_s) == Date.today}.length
    membership = 0
    if @current_user.subscriptions
      membership = @current_user.subscriptions.last[:membership]

    end
    if membership == 1 && posts_viewed_today == 3
      return render json: {msg: "cannot view more posts upgrade membership"}, status: :unauthorized
    elsif membership == 2 && posts_viewed_today == 5
      return render json: {msg: "cannot view more posts upgrade membership"}, status: :unauthorized
    elsif membership == 3 && posts_viewed_today == 10
      return render json: {msg: "cannot view more posts upgrade membership"}, status: :unauthorized
    elsif membership == 0 && posts_viewed_today == 1
      return render json: {msg: "cannot view more posts upgrade membership"}, status: :unauthorized
    end

    if @current_user.viewed_posts.find_by(article_id: post_params[:article_id])
      return render json: {msg: "this article already is already viewed"}, status: :unprocessable_entity
    end
    @viewed_article = ViewedPost.new(user_id: @current_user.id, article_id: post_params[:article_id])
    if @viewed_article.save
---
INSERT INTO "viewed_posts" ("article_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["article_id", 1], ["user_id", 1], ["created_at", "2023-08-07 08:50:57.462654"], ["updated_at", "2023-08-07 08:50:57.462654"]]
SELECT "viewed_posts".* FROM "viewed_posts" WHERE "viewed_posts"."user_id" = ?  [["user_id", 1]]
SELECT "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."user_id" = ? ORDER BY "subscriptions"."id" DESC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "viewed_posts".* FROM "viewed_posts" WHERE "viewed_posts"."user_id" = ? AND "viewed_posts"."article_id" = ? LIMIT ?  [["user_id", 3], ["article_id", 2], ["LIMIT", 1]]
INSERT INTO "viewed_posts" ("article_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["article_id", 2], ["user_id", 3], ["created_at", "2023-08-07 13:27:29.436117"], ["updated_at", "2023-08-07 13:27:29.436117"]]

  def require_authentication
    header = request.headers['Authorization']
    token = header.split(' ').last if header

    begin
      decoded_token = JWT.decode(token, 'your_secret_key', true, algorithm: 'HS256')
      render json: {error: "invalid token"} if !decoded_token[0]['user_id']
      @current_user = User.find(decoded_token[0]['user_id'])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]